scripts/taurus/main.yaml
settings:
  env:
    CONCURRENCY: 1
    TEST_TIME: 15s
    RAMP_UP: 0m
    SCENARIO: SendNotificationPresigned
    API_KEY: fakeapikey
    BASE_URL: http://localhost:8080
    INPUT_FILE: inputs/notifications_data.csv

execution:
  - executor: jmeter
    concurrency: ${CONCURRENCY}
    hold-for: ${TEST_TIME}
    ramp-up: ${RAMP_UP}
    scenario: ${SCENARIO}


reporting:
  - module: console
  - module: final-stats
    summary: true  # overall samples count and percent of failures
    percentiles: true  # display average times and percentiles
    summary-labels: true # provides list of sample labels, status, percentage of completed, avg time and errors
    failed-labels: true  # provides list of sample labels with failures
    test-duration: true  # provides test duration
    concurrency: true
    dump-cvs: output.csv

included-configs:
  - scenario/SendNotificationScenarios.yaml